app/controllers/dogs_controller.rb

  def index

    if params[:size].present? && params[:left_alone].present? && params[:housetrained].present? && params[:needs_another_dog].present? && params[:kids].present? && params[:activity].present? && params[:yard].present?
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."size" = ? AND "dogs"."left_alone" = ? AND "dogs"."housetrained" = ? AND "dogs"."needs_another_dog" = ? AND "dogs"."kids" = ? AND "dogs"."activity" = ? AND "dogs"."yard" = ?  [["size", "small"], ["left_alone", "yes"], ["housetrained", "yes"], ["needs_another_dog", "no"], ["kids", "no"], ["activity", "mild"], ["yard", "no"]]

  def show
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 0]]

  def edit
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # params[:user_id] = current_user.id
    @dog = Dog.create(dog_params)
    @dog.user = current_user
    if @dog.save
---
INSERT INTO "dogs" ("name", "age", "size", "left_alone", "housetrained", "needs_another_dog", "kids", "activity", "yard", "url", "blurb", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "dogs" SET "user_id" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["user_id", 1], ["updated_at", "2015-07-29 19:28:02.089659"], ["id", 13]]

  def update
    @dog = Dog.find(params[:id])
    if @dog.update(dog_params)
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "dogs" SET "left_alone" = ?, "housetrained" = ?, "needs_another_dog" = ?, "kids" = ?, "activity" = ?, "yard" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["left_alone", "yes"], ["housetrained", "yes"], ["needs_another_dog", "yes"], ["kids", "yes"], ["activity", "medium"], ["yard", "no"], ["updated_at", "2015-07-28 01:39:05.348334"], ["id", 1]]

  def destroy
    @dog = Dog.find(params[:id])
    @dog.destroy
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 4]]