app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "shelter_name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "shelter_name" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["shelter_name", "Death Row Dogs Rescue"], ["address", "57611, Sherman Oaks, CA 91413 "], ["updated_at", "2015-07-31 02:43:10.789089"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)